
import 張家銓_學習成果_02副v3

張家銓_學習成果_02副v3.aaa()
#print(張家銓_學習成果_02副v2.r)

張家銓_學習成果_02副v3.bbb()
#print(張家銓_學習成果_02副v2.r)

張家銓_學習成果_02副v3.ccc()
#print(張家銓_學習成果_02副v2.r)

張家銓_學習成果_02副v3.ddd()
#print(張家銓_學習成果_02副v2.r)

張家銓_學習成果_02副v3.eee()
#print(張家銓_學習成果_02副v2.r)

張家銓_學習成果_02副v3.fff()
#print(張家銓_學習成果_02副v2.r)

#print('-------------------------')


x=int(input("輸入第一個數字:"))
y=int(input("輸入第二個數字:"))
z=str(input("輸入算法:"))

張家銓_學習成果_02副v3.x = x#輸入至副本X才有辦法運作
張家銓_學習成果_02副v3.y = y#輸入至副本Y才有辦法運作

if z in 張家銓_學習成果_02副v3.d:
    v = 張家銓_學習成果_02副v3.d[z]
    v()
    print(張家銓_學習成果_02副v3.r)